In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
%matplotlib inline

In [2]:
ship = pd.read_csv('titanic.csv')

In [3]:
ship.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 21 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  1309 non-null   int64
 1   Survived     891 non-null    float64
 2   Pclass       1309 non-null   int64
 3   Name         1309 non-null   object
 4   Sex          1309 non-null   object
 5   Age          1046 non-null   float64
 6   SibSp        1309 non-null   int64
 7   Parch        1309 non-null   int64
 8   Ticket       1309 non-null   object
 9   Fare         1308 non-null   float64
 10  Cabin        295 non-null    object
 11  Embarked     1307 non-null   object
 12  WikiId       1304 non-null   float64
 13  Name_wiki    1304 non-null   object
 14  Age_wiki     1302 non-null   float64
 15  Hometown     1304 non-null   object
 16  Boarded      1304 non-null   object
 17  Destination  1304 non-null   object
 18  Lifeboat     502 non-null    object
 19  Body         130 non-null    object
 20  Class        1304 non-null   float64
dtypes: float64(6), int64(4), object(11)
memory usage: 214.9+ KB

In [4]:
ship.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,...,Embarked,WikiId,Name_wiki,Age_wiki,Hometown,Boarded,Destination,Lifeboat,Body,Class
0,1,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,...,S,691.0,"Braund, Mr. Owen Harris",22.0,"Bridgerule, Devon, England",Southampton,"Qu'Appelle Valley, Saskatchewan, Canada",NaN,NaN,3.0
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,...,C,90.0,"Cumings, Mrs. Florence Briggs (née Thayer)",35.0,"New York, New York, US",Cherbourg,"New York, New York, US",4,NaN,1.0
2,3,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,...,S,865.0,"Heikkinen, Miss Laina",26.0,"Jyväskylä, Finland",Southampton,New York City,14?,NaN,3.0
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,...,S,127.0,"Futrelle, Mrs. Lily May (née Peel)",35.0,"Scituate, Massachusetts, US",Southampton,"Scituate, Massachusetts, US",D,NaN,1.0
4,5,0.0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,...,S,627.0,"Allen, Mr. William Henry",35.0,"Birmingham, West Midlands, England",Southampton,New York City,NaN,NaN,3.0

In [5]:
ship = ship.drop(ship[ship['Survived'].isnull()].index)

In [6]:
ship.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 0 to 890
Data columns (total 21 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    float64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
 12  WikiId       889 non-null    float64
 13  Name_wiki    889 non-null    object
 14  Age_wiki     887 non-null    float64
 15  Hometown     889 non-null    object
 16  Boarded      889 non-null    object
 17  Destination  889 non-null    object
 18  Lifeboat     345 non-null    object
 19  Body         87 non-null     object
 20  Class        889 non-null    float64
dtypes: float64(6), int64(4), object(11)
memory usage: 153.1+ KB

In [7]:
ship.drop('PassengerId', 1, inplace=True)

In [8]:
ship.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 0 to 890
Data columns (total 20 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Survived     891 non-null    float64
 1   Pclass       891 non-null    int64
 2   Name         891 non-null    object
 3   Sex          891 non-null    object
 4   Age          714 non-null    float64
 5   SibSp        891 non-null    int64
 6   Parch        891 non-null    int64
 7   Ticket       891 non-null    object
 8   Fare         891 non-null    float64
 9   Cabin        204 non-null    object
 10  Embarked     889 non-null    object
 11  WikiId       889 non-null    float64
 12  Name_wiki    889 non-null    object
 13  Age_wiki     887 non-null    float64
 14  Hometown     889 non-null    object
 15  Boarded      889 non-null    object
 16  Destination  889 non-null    object
 17  Lifeboat     345 non-null    object
 18  Body         87 non-null     object
 19  Class        889 non-null    float64
dtypes: float64(6), int64(3), object(11)
memory usage: 146.2+ KB

In [9]:
ship.drop(['Body', 'Lifeboat'], 1, inplace=True)

In [10]:
ship.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,WikiId,Name_wiki,Age_wiki,Hometown,Boarded,Destination,Class
0,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,691.0,"Braund, Mr. Owen Harris",22.0,"Bridgerule, Devon, England",Southampton,"Qu'Appelle Valley, Saskatchewan, Canada",3.0
1,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,90.0,"Cumings, Mrs. Florence Briggs (née Thayer)",35.0,"New York, New York, US",Cherbourg,"New York, New York, US",1.0
2,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,865.0,"Heikkinen, Miss Laina",26.0,"Jyväskylä, Finland",Southampton,New York City,3.0
3,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,127.0,"Futrelle, Mrs. Lily May (née Peel)",35.0,"Scituate, Massachusetts, US",Southampton,"Scituate, Massachusetts, US",1.0
4,0.0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,627.0,"Allen, Mr. William Henry",35.0,"Birmingham, West Midlands, England",Southampton,New York City,3.0

In [11]:
ship.drop(['Name', 'Name_wiki', 'Age_wiki', 'Hometown', 'Boarded', 'Destination'], 1, inplace=True)

In [12]:
ship.head()

,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,WikiId,Class
0,0.0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,691.0,3.0
1,1.0,1,female,38.0,1,0,PC 17599,71.2833,C85,C,90.0,1.0
2,1.0,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,865.0,3.0
3,1.0,1,female,35.0,1,0,113803,53.1000,C123,S,127.0,1.0
4,0.0,3,male,35.0,0,0,373450,8.0500,NaN,S,627.0,3.0

In [13]:
ship.drop(['WikiId'], 1, inplace=True)

In [14]:
ship.head()

,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Class
0,0.0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,3.0
1,1.0,1,female,38.0,1,0,PC 17599,71.2833,C85,C,1.0
2,1.0,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,3.0
3,1.0,1,female,35.0,1,0,113803,53.1000,C123,S,1.0
4,0.0,3,male,35.0,0,0,373450,8.0500,NaN,S,3.0

In [15]:
len(ship['Ticket'].value_counts())

681

In [16]:
len(ship['Cabin'].value_counts())

147

In [17]:
ship.drop(['Ticket', 'Cabin'], 1, inplace=True)

In [18]:
ship.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked  Class
0       0.0       3    male  22.0      1      0   7.2500        S    3.0
1       1.0       1  female  38.0      1      0  71.2833        C    1.0
2       1.0       3  female  26.0      0      0   7.9250        S    3.0
3       1.0       1  female  35.0      1      0  53.1000        S    1.0
4       0.0       3    male  35.0      0      0   8.0500        S    3.0

In [19]:
ship['Survived'].value_counts()

0.0    549
1.0    342
Name: Survived, dtype: int64

In [20]:
ship['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [21]:
ship['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [22]:
ship.drop(['Class'], 1, inplace=True)

In [23]:
ship.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 0 to 890
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    float64
 1   Pclass    891 non-null    int64
 2   Sex       891 non-null    object
 3   Age       714 non-null    float64
 4   SibSp     891 non-null    int64
 5   Parch     891 non-null    int64
 6   Fare      891 non-null    float64
 7   Embarked  889 non-null    object
dtypes: float64(3), int64(3), object(2)
memory usage: 62.6+ KB

In [24]:
ship.SibSp.value_counts()

0    608
1    209
2     28
4     18
3     16
8      7
5      5
Name: SibSp, dtype: int64

In [25]:
ship['Age'] = ship['Age'].fillna(ship['Age'].mean())

In [26]:
ship.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 0 to 890
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    float64
 1   Pclass    891 non-null    int64
 2   Sex       891 non-null    object
 3   Age       891 non-null    float64
 4   SibSp     891 non-null    int64
 5   Parch     891 non-null    int64
 6   Fare      891 non-null    float64
 7   Embarked  889 non-null    object
dtypes: float64(3), int64(3), object(2)
memory usage: 62.6+ KB

In [27]:
ship.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0       0.0       3    male  22.0      1      0   7.2500        S
1       1.0       1  female  38.0      1      0  71.2833        C
2       1.0       3  female  26.0      0      0   7.9250        S
3       1.0       1  female  35.0      1      0  53.1000        S
4       0.0       3    male  35.0      0      0   8.0500        S

In [28]:
ship['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [29]:
ship = pd.get_dummies(ship, columns=['Sex', 'Embarked'])

In [30]:
ship.head()

,Survived,Pclass,Age,SibSp,Parch,Fare,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S
0,0.0,3,22.0,1,0,7.2500,0,1,0,0,1
1,1.0,1,38.0,1,0,71.2833,1,0,1,0,0
2,1.0,3,26.0,0,0,7.9250,1,0,0,0,1
3,1.0,1,35.0,1,0,53.1000,1,0,0,0,1
4,0.0,3,35.0,0,0,8.0500,0,1,0,0,1

In [31]:
X = ship.drop('Survived', 1)

In [32]:
y = ship['Survived']

In [33]:
from sklearn.model_selection import train_test_split

In [34]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.33, random_state=42)

## Decision Tree

In [36]:
from sklearn.tree import DecisionTreeClassifier
dtc = DecisionTreeClassifier().fit(X_train, y_train)
dtc.score(X_test, y_test)

0.7559322033898305

In [37]:
from sklearn.metrics import accuracy_score

In [41]:
preds = dtc.predict(X_test)

In [42]:
spejimai = pd.Series(data=preds, name='Spėjimas')

In [43]:
accuracy_score(y_test, spejimai)

0.7559322033898305

## Random Forest

In [67]:
from sklearn.ensemble import RandomForestClassifier
rfc = RandomForestClassifier(n_estimators = 10).fit(X_train, y_train)
rfc.score(X_test, y_test)

0.7694915254237288

In [69]:
scores = []
for i in range(200):
    rfc = RandomForestClassifier(n_estimators = i+1).fit(X_train, y_train)
    scores.append(rfc.score(X_test, y_test))

In [71]:
max(scores)

0.823728813559322

# KNN

In [72]:
from sklearn.preprocessing import StandardScaler
scaler = StandardScaler().fit(X)
scaled_features = scaler.transform(X)

In [73]:
features = pd.DataFrame(scaled_features, columns=X.columns)

In [74]:
X_train, X_test, y_train, y_test = train_test_split(features, y, test_size=0.33, random_state=42)

In [76]:
from sklearn.neighbors import KNeighborsClassifier
fish_knc = KNeighborsClassifier(n_neighbors = 3).fit(X_train, y_train)
fish_knc.score(X_test, y_test)

0.7932203389830509

In [77]:
len(y_test)

295

In [80]:
scores = []
for i in range(294):
    fish_knc = KNeighborsClassifier(n_neighbors = i+1).fit(X_train, y_train)
    scores.append(fish_knc.score(X_test, y_test))

In [82]:
max(scores)

0.8305084745762712

## SVC

In [85]:
from sklearn.svm import SVC

In [123]:
svc = SVC().fit(X_train, y_train)

In [124]:
svc.score(X_test, y_test)

0.8203389830508474

In [90]:
from sklearn.naive_bayes import GaussianNB

## Naive Bays

In [91]:
nb = GaussianNB().fit(X_train, y_train)

In [92]:
nb.score(X_test, y_test)

0.7966101694915254

## MLPClassifier

In [115]:
from sklearn.neural_network import MLPClassifier
NN = MLPClassifier(solver='lbfgs', alpha=1e-5, hidden_layer_sizes=(13, 2), random_state=1, max_iter=1000)
NN.fit(X_train, y_train)
NN.score(X_test, y_test)

0.8203389830508474

In [127]:
from sklearn.discriminant_analysis import LinearDiscriminantAnalysis
lda = LinearDiscriminantAnalysis().fit(X_train, y_train)
lda.score(X_test, y_test)

0.7966101694915254

In [128]:
from sklearn.ensemble import GradientBoostingClassifier
gbc = GradientBoostingClassifier().fit(X_train, y_train)
gbc.score(X_test, y_test)

0.8271186440677966